
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       6 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                               |
|:--------:|:--------------------------------------------------------|
|    🟢     | `aws_db_instance.keycloack`                             |
|    🟢     | `aws_db_subnet_group.keycloack`                         |
|    🟢     | `aws_security_group.keycloack`                          |
|    🟢     | `aws_vpc_security_group_egress_rule.keycloack_outgoing` |
|    🟢     | `aws_vpc_security_group_ingress_rule.keycloack-icmp`    |
|    🟢     | `aws_vpc_security_group_ingress_rule.keycloack-mysql`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.keycloack will be created
  + resource "aws_db_instance" "keycloack" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "keycloack"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = "keycloack-"
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + timezone                              = (known after apply)
      + username                              = "keycloack_dba"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.keycloack will be created
  + resource "aws_db_subnet_group" "keycloack" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "keycloack"
      + subnet_ids              = [
          + "subnet-06caf71c8b0afd909",
          + "subnet-0f91dd2675e7a16c3",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_security_group.keycloack will be created
  + resource "aws_security_group" "keycloack" {
      + arn                    = (known after apply)
      + description            = "keycloack RDS instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "keycloack-db-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "keycloack RDS"
        }
      + tags_all               = {
          + "Name"        = "keycloack RDS"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # aws_vpc_security_group_egress_rule.keycloack_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "keycloack_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "outgoing traffic"
        }
      + tags_all               = {
          + "Name"        = "outgoing traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # aws_vpc_security_group_ingress_rule.keycloack-icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "keycloack-icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ICMP traffic"
        }
      + tags_all               = {
          + "Name"        = "ICMP traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.keycloack-mysql will be created
  + resource "aws_vpc_security_group_ingress_rule" "keycloack-mysql" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "Allow mysql traffic"
      + from_port              = 3306
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "mysql access"
        }
      + tags_all               = {
          + "Name"        = "mysql access"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 3306
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.terraform_remote_state.cicd: Reading...%0Amodule.ecs.data.cloudinit_config.ecs: Reading...%0Amodule.keycloak.data.cloudinit_config.ecs: Reading...%0Amodule.release_infrahouse_com["focal"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.jumphost.random_string.asg_name: Refreshing state... [id=02R7BZ]%0Amodule.ecs.data.cloudinit_config.ecs: Read complete after 0s [id=4217720379]%0Amodule.keycloak.data.cloudinit_config.ecs: Read complete after 0s [id=1466757517]%0Amodule.release_infrahouse_com["jammy"].random_password.passphrase: Refreshing state... [id=none]%0Arandom_password.keycloak_admin_password: Refreshing state... [id=none]%0Arandom_pet.keycloak_admin_username: Refreshing state... [id=accepted-asp]%0Amodule.jumphost.random_string.profile-suffix: Refreshing state... [id=Zv01ElhajbB6]%0Amodule.ecs.data.aws_ami.ecs: Reading...%0Amodule.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...%0Amodule.keycloak.data.aws_iam_policy.ecs-task-execution-role-policy: Reading...%0Amodule.infrahouse-toolkit-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.ecs.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.keycloak.aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:cluster/auth]%0Amodule.ecs.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]%0Amodule.infrahouse-puppet-data-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.jumphost.data.aws_ami.ubuntu: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ecs.data.aws_iam_policy_document.instance_policy: Reading...%0Amodule.ecs.data.aws_iam_policy_document.instance_policy: Read complete after 0s [id=1552918899]%0Amodule.ecs.aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:cluster/terraform-registry]%0Amodule.puppet-code-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-focal]%0Adata.terraform_remote_state.cicd: Read complete after 0s%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Reading...%0Amodule.ecs.data.aws_ami.ecs: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_cache_policy.default: Refreshing state... [id=b04aff45-48e1-4501-90d3-998c9fa1f264]%0Amodule.jumphost.data.aws_ami.ubuntu: Read complete after 0s [id=ami-05c969369880fa2c2]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_cache_policy.default: Refreshing state... [id=5db494dd-546b-4231-a0c7-133b245ada49]%0Amodule.keycloak.data.aws_region.current: Reading...%0Amodule.keycloak.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Amodule.ecs.data.aws_caller_identity.current: Reading...%0Amodule.ecs.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=2218315402]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.infrahouse-puppet-data-github.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.keycloak.data.aws_iam_policy_document.assume_role_policy: Reading...%0Amodule.keycloak.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]%0Amodule.keycloak.module.pod.data.aws_caller_identity.current: Reading...%0Amodule.keycloak.module.pod.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.ecs.data.aws_iam_policy.ecs-task-execution-role-policy: Reading...%0Amodule.infrahouse-toolkit-github.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Aaws_key_pair.aleks-Black-MBP: Refreshing state... [id=aleks-Black-MBP]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=83731904]%0Amodule.puppet-code-github.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Amodule.jumphost.aws_efs_file_system.home: Refreshing state... [id=fs-0cbd3749548d04da6]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1585346832]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG]%0Adata.aws_ami.ubuntu_22: Reading...%0Aaws_secretsmanager_secret.keycloak_admin_creds: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd]%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_origin_access_control.repo-storage: Refreshing state... [id=E19JUOM5WL9R3Q]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Adata.aws_ami.ubuntu_22: Read complete after 0s [id=ami-05c969369880fa2c2]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_origin_access_control.repo-storage: Refreshing state... [id=EMY4YRQBY9A64]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_function.http_auth: Refreshing state... [id=release-focal_infrahouse_com-auth]%0Aaws_secretsmanager_secret.registry_client_secret: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:registry_client_secret20240302203708051000000001-UA4zRE]%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.ecs.module.pod.data.aws_caller_identity.current: Reading...%0Amodule.ecs.module.pod.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.jumphost.data.aws_region.current: Reading...%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.keycloak.data.aws_ami.ecs: Reading...%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.keycloak.data.aws_iam_policy_document.instance_policy: Reading...%0Amodule.keycloak.data.aws_iam_policy_document.instance_policy: Read complete after 0s [id=1552918899]%0Amodule.ecs.data.aws_region.current: Reading...%0Amodule.ecs.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.keycloak.data.aws_caller_identity.current: Reading...%0Amodule.keycloak.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_function.http_auth: Refreshing state... [id=release-jammy_infrahouse_com-auth]%0Amodule.keycloak.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.keycloak.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=terraform-registry_instance20240302194935069800000007]%0Amodule.keycloak.data.aws_ami.ecs: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=terraform-registryTaskExecutionRole]%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Adata.aws_region.current: Reading...%0Adata.aws_region.current: Read complete after 0s [id=us-west-1]%0Adata.aws_iam_policy_document.registry_node_permissions: Reading...%0Adata.aws_iam_policy_document.registry_node_permissions: Read complete after 0s [id=1809068043]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005]%0Adata.aws_route53_zone.cicd-ih-com: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=290351380]%0Amodule.keycloak.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=authTaskExecutionRole]%0Amodule.infrahouse-toolkit-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse-toolkit-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=4107919091]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-aws-control-493370826424-github]%0Amodule.puppet-code-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.puppet-code-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2423520793]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-infrahouse-website-infra-github]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG|D6ABCB2B-F850-4487-A764-07263736323E]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq|6586EB13-79C2-424D-AFED-6810E61156D7]%0Aaws_secretsmanager_secret_version.keycloak_admin_creds: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd|terraform-20240302224352723300000003]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/2eed53d3-e1ad-4743-ace5-89c193cd3c65]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/402852e1-7054-4cea-80ac-3ccbee72a398]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Adata.aws_secretsmanager_secret_version.registry_client_secret: Reading...%0Adata.aws_secretsmanager_secret_version.registry_client_secret: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:registry_client_secret20240302203708051000000001-UA4zRE|AWSCURRENT]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_logging.server-logs: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_logging.server-logs: Refreshing state... [id=infrahouse-release-focal]%0Adata.aws_route53_zone.cicd-ih-com: Read complete after 1s [id=Z06790082OU0POPWOCPZ4]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=auth_instance20240302223634852000000001]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Amodule.keycloak.data.aws_iam_policy.ecs-task-execution-role-policy: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.ecs.data.aws_iam_policy.ecs-task-execution-role-policy: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Adata.aws_iam_policy_document.registry_node_assume: Reading...%0Adata.aws_iam_policy_document.registry_node_assume: Read complete after 0s [id=3719449782]%0Aaws_iam_policy.registry_node: Refreshing state... [id=arn:aws:iam::493370826424:policy/registry-node-20240303052126090300000001]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=terraform-registry_instance]%0Amodule.ecs.module.pod.data.aws_ami.selected: Reading...%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Reading...%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Read complete after 0s [id=1754214164]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost-Zv01ElhajbB620240223005112022800000002]%0Amodule.ecs.module.pod.data.aws_ami.selected: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.infrahouse-puppet-data-github.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-puppet-data-github]%0Amodule.infrahouse-toolkit-github.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-toolkit-github]%0Amodule.keycloak.data.aws_key_pair.ssh_key_pair: Reading...%0Amodule.ecs.data.aws_key_pair.ssh_key_pair: Reading...%0Amodule.keycloak.data.aws_key_pair.ssh_key_pair: Read complete after 0s [id=key-09febf212ac7461a1]%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost-Zv01ElhajbB6]%0Amodule.ecs.data.aws_key_pair.ssh_key_pair: Read complete after 0s [id=key-09febf212ac7461a1]%0Amodule.puppet-code-github.aws_iam_role.github: Refreshing state... [id=ih-tf-puppet-code-github]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-jammy,private]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-focal,private]%0Amodule.management.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0e1eea4ce5b798046]%0Amodule.management.aws_vpc_security_group_ingress_rule.default[0]: Refreshing state... [id=sgr-06140053abc62a119]%0Amodule.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-04b8845d896c6ebde]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-06caf71c8b0afd909]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-032c75541921bd8f1]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0ac1c23091a58b0bd]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.keycloak.module.pod.data.aws_ami.selected: Reading...%0Aaws_route53_record.ci-cd-ns: Refreshing state... [id=Z07662251LH3YRF2ERM3G_ci-cd.infrahouse.com_NS]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs,private]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs,private]%0Amodule.keycloak.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=authTaskExecutionRole-20240302223635181000000008]%0Amodule.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=terraform-registryTaskExecutionRole-20240302194935897700000009]%0Aaws_iam_role.registry-node: Refreshing state... [id=registry-node-20240303052126090700000002]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/terraform-registry_instance20240302194935067200000001]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=auth_instance]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=709841391]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Aaws_iam_role.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github]%0Amodule.keycloak.module.pod.data.aws_ami.selected: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Read complete after 0s [id=1709618770]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005112691200000007]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-jammy.infrahouse.com]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-focal.infrahouse.com]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/auth_instance20240302223634853400000003]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-0a3949a8a5f094171]%0Amodule.keycloak.aws_ecs_task_definition.ecs: Refreshing state... [id=auth]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.cert_validation["release-jammy.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__047ae29925ec0297eaebfeddc886f234.release-jammy.infrahouse.com._CNAME]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.cert_validation["release-focal.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__87f2ead3abf68134c497bf52718e07b1.release-focal.infrahouse.com._CNAME]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0ac1c23091a58b0bd1080289494]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-01521500562fd17b0]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-03418f8ebac8aa40b]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.keycloak.module.pod.data.aws_route53_zone.webserver_zone: Reading...%0Amodule.ecs.module.pod.data.aws_route53_zone.webserver_zone: Reading...%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=terraform-registry_instance20240302194935069800000007-20240302194935884600000008]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-0d4e2ee96452d86fe]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Aaws_iam_role_policy_attachment.task_role: Refreshing state... [id=registry-node-20240303052126090700000002-20240303052126601400000003]%0Amodule.keycloak.data.aws_subnet.selected: Reading...%0Amodule.jumphost.data.aws_subnet.nlb_selected: Reading...%0Amodule.keycloak.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.ecs.data.aws_subnet.selected: Reading...%0Amodule.jumphost.data.aws_subnet.selected: Reading...%0Amodule.jumphost.data.aws_subnet.nlb_selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=auth_instance20240302223634852000000001-20240302223635213800000009]%0Amodule.ecs.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.ecs.aws_ecs_task_definition.ecs: Refreshing state... [id=terraform-registry]%0Amodule.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-032c75541921bd8f11080289494]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[1]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[1]: Read complete after 0s [id=3967319674]%0Amodule.jumphost.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[2]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[2]: Read complete after 0s [id=2166003714]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[2]: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[1]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[0]: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[2]: Read complete after 0s [id=62441911]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[1]: Read complete after 0s [id=1286761665]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[0]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[0]: Read complete after 0s [id=4198845318]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[0]: Read complete after 0s [id=571510222]%0Amodule.keycloak.module.pod.data.aws_subnet.selected: Reading...%0Amodule.ecs.module.pod.data.aws_subnet.selected: Reading...%0Amodule.jumphost.data.aws_vpc.nlb_selected: Reading...%0Amodule.keycloak.aws_security_group.backend_extra: Refreshing state... [id=sg-08cca82b25623d4ee]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.442 +0000 UTC]%0Amodule.keycloak.module.pod.data.aws_subnet.selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.051 +0000 UTC]%0Amodule.ecs.aws_security_group.backend_extra: Refreshing state... [id=sg-0df97e04eee18cc72]%0Amodule.ecs.module.pod.data.aws_subnet.selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.jumphost.aws_security_group.efs: Refreshing state... [id=sg-02906b36c9d1be156]%0Amodule.jumphost.aws_security_group.jumphost: Refreshing state... [id=sg-0bc8f2feda3620f6f]%0Amodule.jumphost.data.aws_vpc.selected: Reading...%0Amodule.ecs.module.pod.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.keycloak.module.pod.aws_security_group.backend: Refreshing state... [id=sg-06533e906d784b2a5]%0Amodule.keycloak.module.pod.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.keycloak.module.pod.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59]%0Amodule.keycloak.module.pod.aws_security_group.alb: Refreshing state... [id=sg-04a8761a74826b4f8]%0Amodule.keycloak.module.pod.data.aws_vpc.service: Reading...%0Amodule.ecs.module.pod.data.aws_vpc.service: Reading...%0Amodule.ecs.module.pod.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302194935067400000002/c7f427e0e1d228fe]%0Amodule.ecs.module.pod.aws_security_group.backend: Refreshing state... [id=sg-04b9363834e13a23e]%0Amodule.jumphost.data.aws_vpc.nlb_selected: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.ecs.module.pod.aws_security_group.alb: Refreshing state... [id=sg-048f21fa3499d69af]%0Amodule.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_user: Refreshing state... [id=sgr-0fb261fe3f35597f1]%0Amodule.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_reserved: Refreshing state... [id=sgr-08439d8ce172557ba]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github-20230818034150993400000001]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2714260376]%0Amodule.ecs.module.pod.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/32a7b391-4cc3-48ff-8fc1-3f4994a9b351]%0Amodule.ecs.aws_vpc_security_group_ingress_rule.backend_extra_reserved: Refreshing state... [id=sgr-000ecebf750fc1bf1]%0Amodule.ecs.aws_vpc_security_group_ingress_rule.backend_extra_user: Refreshing state... [id=sgr-02b52993d3250d3a0]%0Amodule.jumphost.data.aws_vpc.selected: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.icmp: Refreshing state... [id=sgr-0335952ea4ac17465]%0Amodule.keycloak.module.pod.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/833268fe-cb8e-4613-97cb-1f1548952f1a]%0Amodule.keycloak.module.pod.data.aws_vpc.service: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_lb.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/jumpho20240226175403880200000003/b3fc749d99e1aea6]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-001743d1d2257c40b]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.ssh: Refreshing state... [id=sgr-08214d93ee7212b60]%0Amodule.ecs.module.pod.data.aws_vpc.service: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_vpc_security_group_egress_rule.default: Refreshing state... [id=sgr-09df3a8ea086f41c3]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.efs_icmp: Refreshing state... [id=sgr-05152071ab2f7b9e3]%0Amodule.jumphost.aws_vpc_security_group_egress_rule.efs: Refreshing state... [id=sgr-0db18bc63ee576445]%0Amodule.jumphost.aws_efs_mount_target.packages["subnet-06caf71c8b0afd909"]: Refreshing state... [id=fsmt-05668d06fda5b96b6]%0Amodule.jumphost.aws_efs_mount_target.packages["subnet-0f91dd2675e7a16c3"]: Refreshing state... [id=fsmt-0d025cfc9c7ee2852]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input: Refreshing state... [id=sgr-0ec0eed9f3d8a3ab7]%0Amodule.keycloak.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing: Refreshing state... [id=sgr-084a4b4a7956275e6]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp: Refreshing state... [id=sgr-0da95d368ec0bcbdb]%0Amodule.keycloak.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing: Refreshing state... [id=sgr-08c12a045e8ba9745]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port: Refreshing state... [id=sgr-0cc902990fde04156]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.https: Refreshing state... [id=sgr-08092ae9826c38ee9]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp: Refreshing state... [id=sgr-05b0c467d0cc6084a]%0Amodule.keycloak.module.pod.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c]%0Amodule.jumphost.aws_lb_target_group.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/jumpho20240226175402900300000002/e819b391374f847e]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2899629952]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github-20230817010818258200000001]%0Amodule.keycloak.module.pod.aws_launch_template.website: Refreshing state... [id=lt-0d93139ab32de43aa]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_distribution.repo: Refreshing state... [id=E1IILWIY0OU78B]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input: Refreshing state... [id=sgr-07a5dea5dbb291aae]%0Amodule.ecs.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing: Refreshing state... [id=sgr-0de12114d80af02de]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_distribution.repo: Refreshing state... [id=E161QGCPE3JIOK]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp: Refreshing state... [id=sgr-043d02ddfb9745980]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.https: Refreshing state... [id=sgr-0a32d4cf4fe9ff4af]%0Amodule.ecs.module.pod.aws_launch_template.website: Refreshing state... [id=lt-0b338e0594e73e11a]%0Amodule.ecs.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing: Refreshing state... [id=sgr-0ff88016915a07fda]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp: Refreshing state... [id=sgr-0e10c5523b00f7c23]%0Amodule.ecs.module.pod.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/terraf2024030219493612940000000a/1f20b225c3278266]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port: Refreshing state... [id=sgr-0c5501ac99c777076]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.efs: Refreshing state... [id=sgr-011e2fea66d74b99f]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local: Refreshing state... [id=sgr-0bbb79202dde3e83d]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic: Refreshing state... [id=sgr-0d168218efcb7219b]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local: Refreshing state... [id=sgr-004893c7e1cf4250f]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic: Refreshing state... [id=sgr-06aec0ef1d95a1378]%0Amodule.ecs.module.pod.aws_route53_record.cert_validation["registry.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__bec7dafd8b0071d5633275441f36976e.registry.infrahouse.com._CNAME]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.jumphost.aws_route53_record.jumphost_cname: Refreshing state... [id=Z07662251LH3YRF2ERM3G_jumphost.infrahouse.com_CNAME]%0Amodule.keycloak.module.pod.aws_route53_record.cert_validation["auth.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__896b3c1fdc69f951f23cbb89d74549e8.auth.infrahouse.com._CNAME]%0Amodule.keycloak.module.pod.aws_autoscaling_group.website: Refreshing state... [id=auth2024030222363784960000000d]%0Amodule.keycloak.module.pod.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/3f453601d67d421e]%0Amodule.keycloak.module.pod.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_auth.infrahouse.com_A]%0Amodule.ecs.module.pod.aws_autoscaling_group.website: Refreshing state... [id=terraf2024030219493674520000000d]%0Amodule.jumphost.aws_lb_listener.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/net/jumpho20240226175403880200000003/b3fc749d99e1aea6/91aca9d503ce64cc]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20240223005113359100000009-02R7BZ]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-cloudfront-access: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-cloudfront-access: Read complete after 0s [id=133085117]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-cloudfront-access: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-cloudfront-access: Read complete after 0s [id=3872546644]%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-jammy.infrahouse.com_A]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-focal.infrahouse.com_A]%0Amodule.ecs.module.pod.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_registry.infrahouse.com_A]%0Amodule.ecs.module.pod.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/terraf2024030219493612940000000a/1f20b225c3278266/9c419e4a169d61e1]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin-20230818034158985100000002]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-access: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-access: Read complete after 0s [id=2929434109]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-access: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-access: Read complete after 0s [id=4209130619]%0Amodule.keycloak.module.pod.aws_autoscaling_policy.cpu_load: Refreshing state... [id=auth2024030222363784960000000d]%0Amodule.ecs.module.pod.aws_acm_certificate_validation.website: Refreshing state... [id=2024-03-02 19:49:53.063 +0000 UTC]%0Amodule.ecs.module.pod.aws_autoscaling_policy.cpu_load: Refreshing state... [id=terraf2024030219493674520000000d]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_policy.bucket-access: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_policy.bucket-access: Refreshing state... [id=infrahouse-release-focal]%0Amodule.keycloak.aws_ecs_capacity_provider.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:capacity-provider/auth]%0Amodule.keycloak.module.pod.aws_acm_certificate_validation.website: Refreshing state... [id=2024-03-02 22:36:51.087 +0000 UTC]%0Amodule.jumphost.data.aws_iam_policy_document.required_permissions: Reading...%0Amodule.ecs.aws_ecs_capacity_provider.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:capacity-provider/terraform-registry]%0Amodule.jumphost.data.aws_iam_policy_document.required_permissions: Read complete after 0s [id=485487314]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Amodule.jumphost.aws_iam_policy.required: Refreshing state... [id=arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014]%0Amodule.keycloak.aws_ecs_service.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:service/auth/auth]%0Amodule.keycloak.aws_ecs_cluster_capacity_providers.ecs: Refreshing state... [id=auth]%0Amodule.ecs.module.pod.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/terraf2024030219493612940000000a/1f20b225c3278266/3a119c99d9f74ead]%0Amodule.ecs.aws_ecs_cluster_capacity_providers.ecs: Refreshing state... [id=terraform-registry]%0Amodule.ecs.aws_ecs_service.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry]%0Amodule.keycloak.module.pod.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df]%0Adata.aws_iam_policy_document.package-publisher: Reading...%0Amodule.keycloak.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/auth/auth]%0Adata.aws_iam_policy_document.package-publisher: Read complete after 0s [id=4050006037]%0Aaws_iam_policy.package-publisher: Refreshing state... [id=arn:aws:iam::493370826424:policy/package-publisher]%0Amodule.ecs.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/terraform-registry/terraform-registry]%0Amodule.keycloak.aws_appautoscaling_policy.ecs_policy: Refreshing state... [id=cpu-auto-scaling]%0Amodule.ecs.aws_appautoscaling_policy.ecs_policy: Refreshing state... [id=cpu-auto-scaling]%0Aaws_iam_role_policy_attachment.infrahouse-puppet-data-github: Refreshing state... [id=ih-tf-infrahouse-puppet-data-github-20231108133200175400000001]%0Aaws_iam_role_policy_attachment.infrahouse-toolkit-github: Refreshing state... [id=ih-tf-infrahouse-toolkit-github-20240229205019467600000001]%0Aaws_iam_role_policy_attachment.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github-20230819214139756300000001]%0Aaws_iam_role_policy_attachment.puppet-code-github: Refreshing state... [id=ih-tf-puppet-code-github-20231108132248583100000001]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"]: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005146320100000015]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"]: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005146325300000016]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_db_instance.keycloack will be created%0A  + resource "aws_db_instance" "keycloack" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = 7%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "keycloack"%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + deletion_protection                   = true%0A      + domain_fqdn                           = (known after apply)%0A      + endpoint                              = (known after apply)%0A      + engine                                = "mysql"%0A      + engine_version                        = "8.0"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = (known after apply)%0A      + identifier_prefix                     = "keycloack-"%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + manage_master_user_password           = true%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + max_allocated_storage                 = 100%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = true%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = false%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags_all                              = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + timezone                              = (known after apply)%0A      + username                              = "keycloack_dba"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_db_subnet_group.keycloack will be created%0A  + resource "aws_db_subnet_group" "keycloack" {%0A      + arn                     = (known after apply)%0A      + description             = "Managed by Terraform"%0A      + id                      = (known after apply)%0A      + name                    = (known after apply)%0A      + name_prefix             = "keycloack"%0A      + subnet_ids              = [%0A          + "subnet-06caf71c8b0afd909",%0A          + "subnet-0f91dd2675e7a16c3",%0A        ]%0A      + supported_network_types = (known after apply)%0A      + tags_all                = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + vpc_id                  = (known after apply)%0A    }%0A%0A  # aws_security_group.keycloack will be created%0A  + resource "aws_security_group" "keycloack" {%0A      + arn                    = (known after apply)%0A      + description            = "keycloack RDS instance"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "keycloack-db-"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "keycloack RDS"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "keycloack RDS"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + vpc_id                 = "vpc-08e19d859c26d18b2"%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.keycloack_outgoing will be created%0A  + resource "aws_vpc_security_group_egress_rule" "keycloack_outgoing" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "outgoing traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "outgoing traffic"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.keycloack-icmp will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "keycloack-icmp" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow all ICMP traffic"%0A      + from_port              = -1%0A      + id                     = (known after apply)%0A      + ip_protocol            = "icmp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "ICMP traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "ICMP traffic"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + to_port                = -1%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.keycloack-mysql will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "keycloack-mysql" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "10.0.0.0/22"%0A      + description            = "Allow mysql traffic"%0A      + from_port              = 3306%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "mysql access"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "mysql access"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + to_port                = 3306%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgYXdzX2RiX2luc3RhbmNlLmtleWNsb2FjayB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19kYl9pbnN0YW5jZVwiIFwia2V5Y2xvYWNrXCIge1xuICAgICAgKyBhZGRyZXNzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhbGxvY2F0ZWRfc3RvcmFnZSAgICAgICAgICAgICAgICAgICAgID0gMTBcbiAgICAgICsgYXBwbHlfaW1tZWRpYXRlbHkgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGF1dG9fbWlub3JfdmVyc2lvbl91cGdyYWRlICAgICAgICAgICAgPSB0cnVlXG4gICAgICArIGF2YWlsYWJpbGl0eV96b25lICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJhY2t1cF9yZXRlbnRpb25fcGVyaW9kICAgICAgICAgICAgICAgPSA3XG4gICAgICArIGJhY2t1cF90YXJnZXQgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJhY2t1cF93aW5kb3cgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNhX2NlcnRfaWRlbnRpZmllciAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNoYXJhY3Rlcl9zZXRfbmFtZSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNvcHlfdGFnc190b19zbmFwc2hvdCAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBkYl9uYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2tcIlxuICAgICAgKyBkYl9zdWJuZXRfZ3JvdXBfbmFtZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZWxldGVfYXV0b21hdGVkX2JhY2t1cHMgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBkZWxldGlvbl9wcm90ZWN0aW9uICAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBkb21haW5fZnFkbiAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBlbmRwb2ludCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBlbmdpbmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJteXNxbFwiXG4gICAgICArIGVuZ2luZV92ZXJzaW9uICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjguMFwiXG4gICAgICArIGVuZ2luZV92ZXJzaW9uX2FjdHVhbCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkZW50aWZpZXIgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkZW50aWZpZXJfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2Fjay1cIlxuICAgICAgKyBpbnN0YW5jZV9jbGFzcyAgICAgICAgICAgICAgICAgICAgICAgID0gXCJkYi50My5taWNyb1wiXG4gICAgICArIGlvcHMgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGttc19rZXlfaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGxhdGVzdF9yZXN0b3JhYmxlX3RpbWUgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGxpY2Vuc2VfbW9kZWwgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGxpc3RlbmVyX2VuZHBvaW50ICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1haW50ZW5hbmNlX3dpbmRvdyAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1hbmFnZV9tYXN0ZXJfdXNlcl9wYXNzd29yZCAgICAgICAgICAgPSB0cnVlXG4gICAgICArIG1hc3Rlcl91c2VyX3NlY3JldCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1hc3Rlcl91c2VyX3NlY3JldF9rbXNfa2V5X2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1heF9hbGxvY2F0ZWRfc3RvcmFnZSAgICAgICAgICAgICAgICAgPSAxMDBcbiAgICAgICsgbW9uaXRvcmluZ19pbnRlcnZhbCAgICAgICAgICAgICAgICAgICA9IDBcbiAgICAgICsgbW9uaXRvcmluZ19yb2xlX2FybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbXVsdGlfYXogICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgICsgbmNoYXJfY2hhcmFjdGVyX3NldF9uYW1lICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmV0d29ya190eXBlICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3B0aW9uX2dyb3VwX25hbWUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGFyYW1ldGVyX2dyb3VwX25hbWUgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGVyZm9ybWFuY2VfaW5zaWdodHNfZW5hYmxlZCAgICAgICAgICA9IGZhbHNlXG4gICAgICArIHBlcmZvcm1hbmNlX2luc2lnaHRzX2ttc19rZXlfaWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBlcmZvcm1hbmNlX2luc2lnaHRzX3JldGVudGlvbl9wZXJpb2QgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvcnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHB1YmxpY2x5X2FjY2Vzc2libGUgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyByZXBsaWNhX21vZGUgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXBsaWNhcyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXNvdXJjZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBza2lwX2ZpbmFsX3NuYXBzaG90ICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgc25hcHNob3RfaWRlbnRpZmllciAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RhdHVzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RvcmFnZV90aHJvdWdocHV0ICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RvcmFnZV90eXBlICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0aW1lem9uZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB1c2VybmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2tfZGJhXCJcbiAgICAgICsgdnBjX3NlY3VyaXR5X2dyb3VwX2lkcyAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBhd3NfZGJfc3VibmV0X2dyb3VwLmtleWNsb2FjayB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19kYl9zdWJuZXRfZ3JvdXBcIiBcImtleWNsb2Fja1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgID0gXCJNYW5hZ2VkIGJ5IFRlcnJhZm9ybVwiXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgICAgPSBcImtleWNsb2Fja1wiXG4gICAgICArIHN1Ym5ldF9pZHMgICAgICAgICAgICAgID0gW1xuICAgICAgICAgICsgXCJzdWJuZXQtMDZjYWY3MWM4YjBhZmQ5MDlcIixcbiAgICAgICAgICArIFwic3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXCIsXG4gICAgICAgIF1cbiAgICAgICsgc3VwcG9ydGVkX25ldHdvcmtfdHlwZXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIGF3c19zZWN1cml0eV9ncm91cC5rZXljbG9hY2sgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfc2VjdXJpdHlfZ3JvdXBcIiBcImtleWNsb2Fja1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwia2V5Y2xvYWNrIFJEUyBpbnN0YW5jZVwiXG4gICAgICArIGVncmVzcyAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGluZ3Jlc3MgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSBcImtleWNsb2Fjay1kYi1cIlxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXZva2VfcnVsZXNfb25fZGVsZXRlID0gZmFsc2VcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiID0gXCJrZXljbG9hY2sgUkRTXCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJrZXljbG9hY2sgUkRTXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB2cGNfaWQgICAgICAgICAgICAgICAgID0gXCJ2cGMtMDhlMTlkODU5YzI2ZDE4YjJcIlxuICAgIH1cblxuICAjIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUua2V5Y2xvYWNrX291dGdvaW5nIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZVwiIFwia2V5Y2xvYWNrX291dGdvaW5nXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIlxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCItMVwiXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiA9IFwib3V0Z29pbmcgdHJhZmZpY1wiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwib3V0Z29pbmcgdHJhZmZpY1wiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5rZXljbG9hY2staWNtcCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJrZXljbG9hY2staWNtcFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCJcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgYWxsIElDTVAgdHJhZmZpY1wiXG4gICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSAtMVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJpY21wXCJcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiID0gXCJJQ01QIHRyYWZmaWNcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIklDTVAgdHJhZmZpY1wiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICAgICsgdG9fcG9ydCAgICAgICAgICAgICAgICA9IC0xXG4gICAgfVxuXG4gICMgYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUua2V5Y2xvYWNrLW15c3FsIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImtleWNsb2Fjay1teXNxbFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMTAuMC4wLjAvMjJcIlxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJBbGxvdyBteXNxbCB0cmFmZmljXCJcbiAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IDMzMDZcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwidGNwXCJcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiID0gXCJteXNxbCBhY2Nlc3NcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIm15c3FsIGFjY2Vzc1wiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICAgICsgdG9fcG9ydCAgICAgICAgICAgICAgICA9IDMzMDZcbiAgICB9XG5cblBsYW46IDYgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuY2ljZDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5jbG91ZGluaXRfY29uZmlnLmVjczogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmNsb3VkaW5pdF9jb25maWcuZWNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5yYW5kb21fcGFzc3dvcmQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bm9uZV0lMEFtb2R1bGUuanVtcGhvc3QucmFuZG9tX3N0cmluZy5hc2dfbmFtZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MDJSN0JaXSUwQW1vZHVsZS5lY3MuZGF0YS5jbG91ZGluaXRfY29uZmlnLmVjczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDIxNzcyMDM3OV0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5jbG91ZGluaXRfY29uZmlnLmVjczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTQ2Njc1NzUxN10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLnJhbmRvbV9wYXNzd29yZC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ub25lXSUwQXJhbmRvbV9wYXNzd29yZC5rZXljbG9ha19hZG1pbl9wYXNzd29yZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bm9uZV0lMEFyYW5kb21fcGV0LmtleWNsb2FrX2FkbWluX3VzZXJuYW1lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hY2NlcHRlZC1hc3BdJTBBbW9kdWxlLmp1bXBob3N0LnJhbmRvbV9zdHJpbmcucHJvZmlsZS1zdWZmaXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVp2MDFFbGhhamJCNl0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2FtaS5lY3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGVfcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2lhbV9wb2xpY3kuZWNzLXRhc2stZXhlY3V0aW9uLXJvbGUtcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtdG9vbGtpdC1naXRodWIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX2Vjc19jbHVzdGVyLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjbHVzdGVyL2F1dGhdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg1MTExOTQyN10lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGVfcG9saWN5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMDc3ODA0NDc1XSUwQW1vZHVsZS5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5pbnN0YW5jZV9wb2xpY3k6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5zdGFuY2VfcG9saWN5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTUyOTE4ODk5XSUwQW1vZHVsZS5lY3MuYXdzX2Vjc19jbHVzdGVyLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjbHVzdGVyL3RlcnJhZm9ybS1yZWdpc3RyeV0lMEFtb2R1bGUucHVwcGV0LWNvZGUtZ2l0aHViLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NTExMTk0MjddJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF0lMEFkYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuY2ljZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfYW1pLmVjczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTBjNTM1ZTI0YWJiZjEyNzM4XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX2Nsb3VkZnJvbnRfY2FjaGVfcG9saWN5LmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWIwNGFmZjQ1LTQ4ZTEtNDUwMS05MGQzLTk5OGM5ZmExZjI2NF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfYW1pLnVidW50dTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTA1Yzk2OTM2OTg4MGZhMmMyXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2Nsb3VkZnJvbnRfY2FjaGVfcG9saWN5LmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTVkYjQ5NGRkLTU0NmItNDIzMS1hMGM3LTEzM2IyNDVhZGE0OV0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjLnZwYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdF9wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjIxODMxNTQwMl0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGVfcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGVfcG9saWN5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMDc3ODA0NDc1XSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3kuZWNzLXRhc2stZXhlY3V0aW9uLXJvbGUtcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtdG9vbGtpdC1naXRodWIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQWF3c19rZXlfcGFpci5hbGVrcy1CbGFjay1NQlA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzLUJsYWNrLU1CUF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODM3MzE5MDRdJTBBbW9kdWxlLnB1cHBldC1jb2RlLWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Vmc19maWxlX3N5c3RlbS5ob21lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1mcy0wY2JkMzc0OTU0OGQwNGRhNl0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU4NTM0NjgzMl0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWZvY2FsLWd6eFFQcV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR10lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5rZXljbG9ha19hZG1pbl9jcmVkczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9ha19hZG1pbl9jcmVkZW50aWFsczIwMjQwMzAyMjI0MzUyMTQyNTAwMDAwMDAxLXFrZmN4ZF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0LnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15LWxvZ3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfY2xvdWRmcm9udF9vcmlnaW5fYWNjZXNzX2NvbnRyb2wucmVwby1zdG9yYWdlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1FMTlKVU9NNVdMOVIzUV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXQucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWwtbG9nc10lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDVjOTY5MzY5ODgwZmEyYzJdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1rZXktZm9jYWwtWHJUV3JQXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2Nsb3VkZnJvbnRfb3JpZ2luX2FjY2Vzc19jb250cm9sLnJlcG8tc3RvcmFnZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9RU1ZNFlSUUJZOUE2NF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19jbG91ZGZyb250X2Z1bmN0aW9uLmh0dHBfYXV0aDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cmVsZWFzZS1mb2NhbF9pbmZyYWhvdXNlX2NvbS1hdXRoXSUwQWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucmVnaXN0cnlfY2xpZW50X3NlY3JldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpyZWdpc3RyeV9jbGllbnRfc2VjcmV0MjAyNDAzMDIyMDM3MDgwNTEwMDAwMDAwMDEtVUE0elJFXSUwQWF3c19rZXlfcGFpci5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3NdJTBBZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19hbWkuZWNzOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3VzZXJkYXRhLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5zdGFuY2VfcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5zdGFuY2VfcG9saWN5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTUyOTE4ODk5XSUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfY2xvdWRmcm9udF9mdW5jdGlvbi5odHRwX2F1dGg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJlbGVhc2UtamFtbXlfaW5mcmFob3VzZV9jb20tYXV0aF0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NTExMTk0MjddJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1rZXktamFtbXktWHJUV3JQXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeV9pbnN0YW5jZTIwMjQwMzAyMTk0OTM1MDY5ODAwMDAwMDA3XSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19hbWkuZWNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMGM1MzVlMjRhYmJmMTI3MzhdJTBBbW9kdWxlLmVjcy5hd3NfaWFtX3JvbGUuZWNzX3Rhc2tfZXhlY3V0aW9uX3JvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeVRhc2tFeGVjdXRpb25Sb2xlXSUwQWRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFkYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQWRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZWdpc3RyeV9ub2RlX3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZWdpc3RyeV9ub2RlX3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xODA5MDY4MDQzXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtWnYwMUVsaGFqYkI2MjAyNDAyMjMwMDUxMTIwMzI4MDAwMDAwMDVdJTBBZGF0YS5hd3Nfcm91dGU1M196b25lLmNpY2QtaWgtY29tOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yOTAzNTEzODBdJTBBbW9kdWxlLmtleWNsb2FrLmF3c19pYW1fcm9sZS5lY3NfdGFza19leGVjdXRpb25fcm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXV0aFRhc2tFeGVjdXRpb25Sb2xlXSUwQW1vZHVsZS5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtdG9vbGtpdC1naXRodWIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxMDc5MTkwOTFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdJTBBbW9kdWxlLnB1cHBldC1jb2RlLWdpdGh1Yi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5wdXBwZXQtY29kZS1naXRodWIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI0MjM1MjA3OTNdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2loLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1naXRodWJdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR3xENkFCQ0IyQi1GODUwLTQ0ODctQTc2NC0wNzI2MzczNjMyM0VdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWZvY2FsLWd6eFFQcXw2NTg2RUIxMy03OUMyLTQyNEQtQUZFRC02ODEwRTYxMTU2RDddJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmtleWNsb2FrX2FkbWluX2NyZWRzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OmtleWNsb2FrX2FkbWluX2NyZWRlbnRpYWxzMjAyNDAzMDIyMjQzNTIxNDI1MDAwMDAwMDEtcWtmY3hkfHRlcnJhZm9ybS0yMDI0MDMwMjIyNDM1MjcyMzMwMDAwMDAwM10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWxdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX29iamVjdC5kaXN0cmlidXRpb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb25mL2Rpc3RyaWJ1dGlvbnNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmRpc3RyaWJ1dGlvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvbmYvZGlzdHJpYnV0aW9uc10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19hY21fY2VydGlmaWNhdGUucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtZWFzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS8yZWVkNTNkMy1lMWFkLTQ3NDMtYWNlNS04OWMxOTNjZDNjNjVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLWVhc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvNDAyODUyZTEtNzA1NC00Y2VhLTgwYWMtM2NjYmVlNzJhMzk4XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3NlY3VyaXR5X2dyb3VwLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4Yjk2MGI4NWY1OTk2MTAwXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19pbnRlcm5ldF9nYXRld2F5LmlnOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pZ3ctMDc5MDkwZTA5ZWQ1ZGI1ODJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBkNzMzODNhZmViNmFkMTQyXSUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnJlZ2lzdHJ5X2NsaWVudF9zZWNyZXQ6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5yZWdpc3RyeV9jbGllbnRfc2VjcmV0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnJlZ2lzdHJ5X2NsaWVudF9zZWNyZXQyMDI0MDMwMjIwMzcwODA1MTAwMDAwMDAwMS1VQTR6UkV8QVdTQ1VSUkVOVF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfbG9nZ2luZy5zZXJ2ZXItbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9sb2dnaW5nLnNlcnZlci1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWxdJTBBZGF0YS5hd3Nfcm91dGU1M196b25lLmNpY2QtaWgtY29tOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1aMDY3OTAwODJPVTBQT1BXT0NQWjRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teS1sb2dzXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWwtbG9nc10lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhfaW5zdGFuY2UyMDI0MDMwMjIyMzYzNDg1MjAwMDAwMDAwMV0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLm14OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fTVhdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fVFhUXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9ka2ltOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfZ29vZ2xlLl9kb21haW5rZXkuaW5mcmFob3VzZS5jb21fVFhUXSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19pYW1fcG9saWN5LmVjcy10YXNrLWV4ZWN1dGlvbi1yb2xlLXBvbGljeTogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvc2VydmljZS1yb2xlL0FtYXpvbkVDU1Rhc2tFeGVjdXRpb25Sb2xlUG9saWN5XSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fU1BGXSUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfaWFtX3BvbGljeS5lY3MtdGFzay1leGVjdXRpb24tcm9sZS1wb2xpY3k6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L3NlcnZpY2Utcm9sZS9BbWF6b25FQ1NUYXNrRXhlY3V0aW9uUm9sZVBvbGljeV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJlZ2lzdHJ5X25vZGVfYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZWdpc3RyeV9ub2RlX2Fzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzcxOTQ0OTc4Ml0lMEFhd3NfaWFtX3BvbGljeS5yZWdpc3RyeV9ub2RlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9yZWdpc3RyeS1ub2RlLTIwMjQwMzAzMDUyMTI2MDkwMzAwMDAwMDAxXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeV9pbnN0YW5jZV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3NfYW1pLnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5pbmZyYWhvdXNlLWNvbS1naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5pbmZyYWhvdXNlLWNvbS1naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNzU0MjE0MTY0XSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9qdW1waG9zdC1adjAxRWxoYWpiQjYyMDI0MDIyMzAwNTExMjAyMjgwMDAwMDAwMl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3NfYW1pLnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMGM1MzVlMjRhYmJmMTI3MzhdJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViXSUwQW1vZHVsZS5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2UtdG9vbGtpdC1naXRodWJdJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2tleV9wYWlyLnNzaF9rZXlfcGFpcjogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5hd3Nfa2V5X3BhaXIuc3NoX2tleV9wYWlyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2tleV9wYWlyLnNzaF9rZXlfcGFpcjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9a2V5LTA5ZmViZjIxMmFjNzQ2MWExXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtWnYwMUVsaGFqYkI2XSUwQW1vZHVsZS5lY3MuZGF0YS5hd3Nfa2V5X3BhaXIuc3NoX2tleV9wYWlyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1rZXktMDlmZWJmMjEyYWM3NDYxYTFdJTBBbW9kdWxlLnB1cHBldC1jb2RlLWdpdGh1Yi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1wdXBwZXQtY29kZS1naXRodWJdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXkscHJpdmF0ZV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfYWNsLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbCxwcml2YXRlXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUuZGVmYXVsdFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBlMWVlYTRjZTViNzk4MDQ2XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmRlZmF1bHRbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNjE0MDA1M2FiYzYyYTExOV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDRiODg0NWQ4OTZjNmViZGVdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wNmNhZjcxYzhiMGFmZDkwOV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDMyYzc1NTQxOTIxYmQ4ZjFdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDRhMTZlNzRkNWIxMmEzMzhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTldJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGFjMWMyMzA5MWE1OGIwYmRdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuZGVmYXVsdF9tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZDczMzgzYWZlYjZhZDE0MjEwODAyODk0OTRdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfYW1pLnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBYXdzX3JvdXRlNTNfcmVjb3JkLmNpLWNkLW5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfY2ktY2QuaW5mcmFob3VzZS5jb21fTlNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teS1sb2dzLHByaXZhdGVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbC1sb2dzLHByaXZhdGVdJTBBbW9kdWxlLmtleWNsb2FrLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5lY3NfdGFza19leGVjdXRpb25fcm9sZV9wb2xpY3k6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhUYXNrRXhlY3V0aW9uUm9sZS0yMDI0MDMwMjIyMzYzNTE4MTAwMDAwMDAwOF0lMEFtb2R1bGUuZWNzLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5lY3NfdGFza19leGVjdXRpb25fcm9sZV9wb2xpY3k6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeVRhc2tFeGVjdXRpb25Sb2xlLTIwMjQwMzAyMTk0OTM1ODk3NzAwMDAwMDA5XSUwQWF3c19pYW1fcm9sZS5yZWdpc3RyeS1ub2RlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yZWdpc3RyeS1ub2RlLTIwMjQwMzAzMDUyMTI2MDkwNzAwMDAwMDAyXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvdGVycmFmb3JtLXJlZ2lzdHJ5X2luc3RhbmNlMjAyNDAzMDIxOTQ5MzUwNjcyMDAwMDAwMDFdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoX2luc3RhbmNlXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTcwOTg0MTM5MV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zOTExODQ0ODY4XSUwQWF3c19pYW1fcm9sZS5pbmZyYWhvdXNlLWNvbS1naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tLWdpdGh1Yl0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5kYXRhLmF3c19hbWkuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wYzUzNWUyNGFiYmYxMjczOF0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE3MDk2MTg3NzBdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1adjAxRWxoYWpiQjYyMDI0MDIyMzAwNTExMjAzMjgwMDAwMDAwNS0yMDI0MDIyMzAwNTExMjY5MTIwMDAwMDAwN10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19vYmplY3QuZGViLWdwZy1wdWJsaWMta2V5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ERUItR1BHLUtFWS1yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX29iamVjdC5kZWItZ3BnLXB1YmxpYy1rZXk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPURFQi1HUEctS0VZLXJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb21dJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfb2JqZWN0LmluZGV4LWh0bWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZGV4Lmh0bWxdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmluZGV4LWh0bWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZGV4Lmh0bWxdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2F1dGhfaW5zdGFuY2UyMDI0MDMwMjIyMzYzNDg1MzQwMDAwMDAwM10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDJiNDJlNzBkNTJhNWRiN2ZdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTBhMzk0OWE4YTVmMDk0MTcxXSUwQW1vZHVsZS5rZXljbG9hay5hd3NfZWNzX3Rhc2tfZGVmaW5pdGlvbi5lY3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JvdXRlNTNfem9uZS5qdW1waG9zdF96b25lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wicmVsZWFzZS1qYW1teS5pbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX18wNDdhZTI5OTI1ZWMwMjk3ZWFlYmZlZGRjODg2ZjIzNC5yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJyZWxlYXNlLWZvY2FsLmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzg3ZjJlYWQzYWJmNjgxMzRjNDk3YmY1MjcxOGUwN2IxLnJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA0YTE2ZTc0ZDViMTJhMzM4MTA4MDI4OTQ5NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOTliOTU4YWYxOTQ4NWYyYl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wYWMxYzIzMDkxYTU4YjBiZDEwODAyODk0OTRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTAxNTIxNTAwNTYyZmQxN2IwXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTAzNDE4ZjhlYmFjOGFhNDBiXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA4YTQxMDE2MGUyZGNjNTkyXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzZXJ2ZXJfem9uZTogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeV9pbnN0YW5jZTIwMjQwMzAyMTk0OTM1MDY5ODAwMDAwMDA3LTIwMjQwMzAyMTk0OTM1ODg0NjAwMDAwMDA4XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTBkNGUyZWU5NjQ1MmQ4NmZlXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4ZmI5YjUyNjgzMjc3OTQ3XSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC50YXNrX3JvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJlZ2lzdHJ5LW5vZGUtMjAyNDAzMDMwNTIxMjYwOTA3MDAwMDAwMDItMjAyNDAzMDMwNTIxMjY2MDE0MDAwMDAwMDNdJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19zdWJuZXQubmxiX3NlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9c3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXSUwQW1vZHVsZS5lY3MuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19zdWJuZXQubmxiX3NlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMGRmODg1ZGNjOTk0MTg3OTldJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoX2luc3RhbmNlMjAyNDAzMDIyMjM2MzQ4NTIwMDAwMDAwMDEtMjAyNDAzMDIyMjM2MzUyMTM4MDAwMDAwMDldJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkxMDgwMjg5NDk0XSUwQW1vZHVsZS5lY3MuYXdzX2Vjc190YXNrX2RlZmluaXRpb24uZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tcmVnaXN0cnldJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAzMmM3NTU0MTkyMWJkOGYxMTA4MDI4OTQ5NF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzFdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsxXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mzk2NzMxOTY3NF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsyXTogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMl06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIxNjYwMDM3MTRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsyXTogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMV06IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzBdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsyXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NjI0NDE5MTFdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsxXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI4Njc2MTY2NV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzBdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblswXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE5ODg0NTMxOF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzBdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD01NzE1MTAyMjJdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c192cGMubmxiX3NlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmF3c19zZWN1cml0eV9ncm91cC5iYWNrZW5kX2V4dHJhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wOGNjYTgyYjI1NjIzZDRlZV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfcm91dGU1M196b25lLmp1bXBob3N0X3pvbmU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvbi5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0yMDIzLTA3LTI0IDE4OjUxOjM5LjQ0MiArMDAwMCBVVENdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMGRmODg1ZGNjOTk0MTg3OTldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wNy0yNCAxODo1MTozOS4wNTEgKzAwMDAgVVRDXSUwQW1vZHVsZS5lY3MuYXdzX3NlY3VyaXR5X2dyb3VwLmJhY2tlbmRfZXh0cmE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTBkZjk3ZTA0ZWVlMThjYzcyXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3NlY3VyaXR5X2dyb3VwLmVmczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDI5MDZiMzZjOWQxYmUxNTZdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zZWN1cml0eV9ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMGJjOGYyZmVkYTM2MjBmNmZdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3ZwYy5zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19yb3V0ZTUzX3pvbmUud2Vic2VydmVyX3pvbmU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3Nfc2VjdXJpdHlfZ3JvdXAuYmFja2VuZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDY1MzNlOTA2ZDc4NGIyYTVdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2FsYl90YXJnZXRfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjQwMzAyMjIzNjM0ODYxMzAwMDAwMDA2Lzc4MWVjZTkwYmRkZDhkNTldJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3NlY3VyaXR5X2dyb3VwLmFsYjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDRhODc2MWE3NDgyNmI0ZjhdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfdnBjLnNlcnZpY2U6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3NfdnBjLnNlcnZpY2U6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX2FsYl90YXJnZXRfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjQwMzAyMTk0OTM1MDY3NDAwMDAwMDAyL2M3ZjQyN2UwZTFkMjI4ZmVdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19zZWN1cml0eV9ncm91cC5iYWNrZW5kOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wNGI5MzYzODM0ZTEzYTIzZV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfdnBjLm5sYl9zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3Nfc2VjdXJpdHlfZ3JvdXAuYWxiOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wNDhmMjFmYTM0OTlkNjlhZl0lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9leHRyYV91c2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGZiMjYxZmUzZjM1NTk3ZjFdJTBBbW9kdWxlLmtleWNsb2FrLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfZXh0cmFfcmVzZXJ2ZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wODQzOWQ4Y2UxNzI1NTdiYV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1naXRodWItMjAyMzA4MTgwMzQxNTA5OTM0MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI3MTQyNjAzNzZdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hY21fY2VydGlmaWNhdGUud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS8zMmE3YjM5MS00Y2MzLTQ4ZmYtOGZjMS0zZjQ5OTRhOWIzNTFdJTBBbW9kdWxlLmVjcy5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX2V4dHJhX3Jlc2VydmVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDAwZWNlYmY3NTBmYzFiZjFdJTBBbW9kdWxlLmVjcy5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX2V4dHJhX3VzZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wMmI1Mjk5M2QzMjUwZDNhMF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfdnBjLnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmljbXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wMzM1OTUyZWE0YWMxNzQ2NV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfYWNtX2NlcnRpZmljYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvODMzMjY4ZmUtY2I4ZS00NjEzLTk3Y2ItMWYxNTQ4OTUyZjFhXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmRhdGEuYXdzX3ZwYy5zZXJ2aWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYi5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxvYWRiYWxhbmNlci9uZXQvanVtcGhvMjAyNDAyMjYxNzU0MDM4ODAyMDAwMDAwMDMvYjNmYzc0OWQ5OWUxYWVhNl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhdW5jaF90ZW1wbGF0ZS5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bHQtMDAxNzQzZDFkMjI1N2M0MGJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLnNzaDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA4MjE0ZDkzZWU3MjEyYjYwXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c192cGMuc2VydmljZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wOWRmM2E4ZWEwODZmNDFjM10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuZWZzX2ljbXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNTE1MjA3MWFiMmY3YjllM10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5lZnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wZGIxOGJjNjNlZTU3NjQ0NV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Vmc19tb3VudF90YXJnZXQucGFja2FnZXNbXCJzdWJuZXQtMDZjYWY3MWM4YjBhZmQ5MDlcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWZzbXQtMDU2NjhkMDZmZGE1Yjk2YjZdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19lZnNfbW91bnRfdGFyZ2V0LnBhY2thZ2VzW1wic3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1mc210LTBkMDI1Y2ZjOWM3ZWUyODUyXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfc3NoX2lucHV0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGVjMGVlZDlmM2Q4YTNhYjddJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5iYWNrZW5kX291dGdvaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDg0YTRiNGE3OTU2Mjc1ZTZdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9pY21wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGRhOTVkMzY4ZWMwYmNiZGJdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5hbGJfb3V0Z29pbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wOGMxMmEwNDVlOGJhOTc0NV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5hbGJfbGlzdGVuZXJfcG9ydDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBjYzkwMjk5MGZkZTA0MTU2XSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmh0dHBzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDgwOTJhZTk4MjZjMzhlZTldJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYWxiX2ljbXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNWIwYzQ2N2QwY2M2MDg0YV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfYWxiLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsb2FkYmFsYW5jZXIvYXBwL2F1dGgyMDI0MDMwMjIyMzYzNjc4OTAwMDAwMDAwYS9hMjY1NzhjZTQxYzgzMTBjXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfbGJfdGFyZ2V0X2dyb3VwLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6dGFyZ2V0Z3JvdXAvanVtcGhvMjAyNDAyMjYxNzU0MDI5MDAzMDAwMDAwMDIvZTgxOWIzOTEzNzRmODQ3ZV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWItMjAyMzA4MTcwMTA4MTgyNTgyMDAwMDAwMDFdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wZDkzMTM5YWIzMmRlNDNhYV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X2Rpc3RyaWJ1dGlvbi5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1FMUlJTFdJWTBPVTc4Ql0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9zc2hfaW5wdXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wN2E1ZGVhNWRiYjI5MWFhZV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5iYWNrZW5kX291dGdvaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGRlMTIxMTRkODBhZjAyZGVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfY2xvdWRmcm9udF9kaXN0cmlidXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9RTE2MVFHQ1BFM0pJT0tdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfaWNtcDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA0M2QwMmRkZmI5NzQ1OTgwXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW5dJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmh0dHBzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGEzMmQ0Y2Y0ZmU5ZmY0YWZdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19sYXVuY2hfdGVtcGxhdGUud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bHQtMGIzMzhlMDU5NGU3M2UxMWFdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUuYWxiX291dGdvaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGZmODgwMTY5MTVhMDdmZGFdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmFsYl9pY21wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGUxMGM1NTIzYjAwZjdjMjNdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hbGIud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxvYWRiYWxhbmNlci9hcHAvdGVycmFmMjAyNDAzMDIxOTQ5MzYxMjk0MDAwMDAwMGEvMWYyMGIyMjVjMzI3ODI2Nl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYWxiX2xpc3RlbmVyX3BvcnQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wYzU1MDFhYzk5Yzc3NzA3Nl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuZWZzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDExZTJmZWE2NmQ3NGI5OWZdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9zc2hfbG9jYWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wYmJiNzkyMDJkZGUzZTgzZF0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3VzZXJfdHJhZmZpYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBkMTY4MjE4ZWZjYjcyMTliXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3NzaF9sb2NhbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTAwNDg5M2M3ZTFjZjQyNTBmXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3VzZXJfdHJhZmZpYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA2YWVjMGVmMWQ5NWExMzc4XSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wicmVnaXN0cnkuaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fYmVjN2RhZmQ4YjAwNzFkNTYzMzI3NTQ0MWYzNjk3NmUucmVnaXN0cnkuaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5dJTBBbW9kdWxlLmp1bXBob3N0LmF3c19yb3V0ZTUzX3JlY29yZC5qdW1waG9zdF9jbmFtZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2p1bXBob3N0LmluZnJhaG91c2UuY29tX0NOQU1FXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJhdXRoLmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzg5NmIzYzFmZGM2OWY5NTFmMjNjYmI4OWQ3NDU0OWU4LmF1dGguaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hdXRvc2NhbGluZ19ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoMjAyNDAzMDIyMjM2Mzc4NDk2MDAwMDAwMGRdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2FsYl9saXN0ZW5lci5yZWRpcmVjdF90b19zc2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsaXN0ZW5lci9hcHAvYXV0aDIwMjQwMzAyMjIzNjM2Nzg5MDAwMDAwMDBhL2EyNjU3OGNlNDFjODMxMGMvM2Y0NTM2MDFkNjdkNDIxZV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3Nfcm91dGU1M19yZWNvcmQuZXh0cmFbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19hdXRoLmluZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hdXRvc2NhbGluZ19ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWYyMDI0MDMwMjE5NDkzNjc0NTIwMDAwMDAwZF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xiX2xpc3RlbmVyLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvbmV0L2p1bXBobzIwMjQwMjI2MTc1NDAzODgwMjAwMDAwMDAzL2IzZmM3NDlkOTllMWFlYTYvOTFhY2E5ZDUwM2NlNjRjY10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC0yMDI0MDIyMzAwNTExMzM1OTEwMDAwMDAwOS0wMlI3QlpdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1jbG91ZGZyb250LWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtY2xvdWRmcm9udC1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzMzA4NTExN10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWNsb3VkZnJvbnQtYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1jbG91ZGZyb250LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mzg3MjU0NjY0NF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19yb3V0ZTUzX3JlY29yZC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfcmVsZWFzZS1qYW1teS5pbmZyYWhvdXNlLmNvbV9BXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19yZWxlYXNlLWZvY2FsLmluZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19yb3V0ZTUzX3JlY29yZC5leHRyYVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX3JlZ2lzdHJ5LmluZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hbGJfbGlzdGVuZXIucmVkaXJlY3RfdG9fc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3RlcnJhZjIwMjQwMzAyMTk0OTM2MTI5NDAwMDAwMDBhLzFmMjBiMjI1YzMyNzgyNjYvOWM0MTllNGExNjlkNjFlMV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLTIwMjMwODE4MDM0MTU4OTg1MTAwMDAwMDAyXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI5Mjk0MzQxMDldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDIwOTEzMDYxOV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfYXV0b3NjYWxpbmdfcG9saWN5LmNwdV9sb2FkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoMjAyNDAzMDIyMjM2Mzc4NDk2MDAwMDAwMGRdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvbi53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0yMDI0LTAzLTAyIDE5OjQ5OjUzLjA2MyArMDAwMCBVVENdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hdXRvc2NhbGluZ19wb2xpY3kuY3B1X2xvYWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZjIwMjQwMzAyMTk0OTM2NzQ1MjAwMDAwMDBkXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9wb2xpY3kuYnVja2V0LWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9wb2xpY3kuYnVja2V0LWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5rZXljbG9hay5hd3NfZWNzX2NhcGFjaXR5X3Byb3ZpZGVyLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjYXBhY2l0eS1wcm92aWRlci9hdXRoXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvbi53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0yMDI0LTAzLTAyIDIyOjM2OjUxLjA4NyArMDAwMCBVVENdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucmVxdWlyZWRfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLmF3c19lY3NfY2FwYWNpdHlfcHJvdmlkZXIuZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNhcGFjaXR5LXByb3ZpZGVyL3RlcnJhZm9ybS1yZWdpc3RyeV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZXF1aXJlZF9wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDg1NDg3MzE0XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4tMjAyMzA3MDkxNjQzMjEzMTk5MDAwMDAwMDFdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LnJlcXVpcmVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS90ZXJyYWZvcm0tMjAyNDAyMjMwMDUxNDU5Mjk4MDAwMDAwMTRdJTBBbW9kdWxlLmtleWNsb2FrLmF3c19lY3Nfc2VydmljZS5lY3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VydmljZS9hdXRoL2F1dGhdJTBBbW9kdWxlLmtleWNsb2FrLmF3c19lY3NfY2x1c3Rlcl9jYXBhY2l0eV9wcm92aWRlcnMuZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfbGJfbGlzdGVuZXIuc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3RlcnJhZjIwMjQwMzAyMTk0OTM2MTI5NDAwMDAwMDBhLzFmMjBiMjI1YzMyNzgyNjYvM2ExMTljOTlkOWY3NGVhZF0lMEFtb2R1bGUuZWNzLmF3c19lY3NfY2x1c3Rlcl9jYXBhY2l0eV9wcm92aWRlcnMuZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tcmVnaXN0cnldJTBBbW9kdWxlLmVjcy5hd3NfZWNzX3NlcnZpY2UuZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlcnZpY2UvdGVycmFmb3JtLXJlZ2lzdHJ5L3RlcnJhZm9ybS1yZWdpc3RyeV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfbGJfbGlzdGVuZXIuc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL2F1dGgyMDI0MDMwMjIyMzYzNjc4OTAwMDAwMDAwYS9hMjY1NzhjZTQxYzgzMTBjLzk3YjVmZmU0YzllMDA3ZGZdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wYWNrYWdlLXB1Ymxpc2hlcjogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5hd3NfYXBwYXV0b3NjYWxpbmdfdGFyZ2V0LmVjc190YXJnZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UvYXV0aC9hdXRoXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGFja2FnZS1wdWJsaXNoZXI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwNTAwMDYwMzddJTBBYXdzX2lhbV9wb2xpY3kucGFja2FnZS1wdWJsaXNoZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3BhY2thZ2UtcHVibGlzaGVyXSUwQW1vZHVsZS5lY3MuYXdzX2FwcGF1dG9zY2FsaW5nX3RhcmdldC5lY3NfdGFyZ2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlL3RlcnJhZm9ybS1yZWdpc3RyeS90ZXJyYWZvcm0tcmVnaXN0cnldJTBBbW9kdWxlLmtleWNsb2FrLmF3c19hcHBhdXRvc2NhbGluZ19wb2xpY3kuZWNzX3BvbGljeTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y3B1LWF1dG8tc2NhbGluZ10lMEFtb2R1bGUuZWNzLmF3c19hcHBhdXRvc2NhbGluZ19wb2xpY3kuZWNzX3BvbGljeTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y3B1LWF1dG8tc2NhbGluZ10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaW5mcmFob3VzZS1wdXBwZXQtZGF0YS1naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLTIwMjMxMTA4MTMzMjAwMTc1NDAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLTIwMjQwMjI5MjA1MDE5NDY3NjAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5pbmZyYWhvdXNlLWNvbS1naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tLWdpdGh1Yi0yMDIzMDgxOTIxNDEzOTc1NjMwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucHVwcGV0LWNvZGUtZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1wdXBwZXQtY29kZS1naXRodWItMjAyMzExMDgxMzIyNDg1ODMxMDAwMDAwMDFdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5leHRyYVtcInBhY2thZ2UtcHVibGlzaGVyXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1adjAxRWxoYWpiQjYyMDI0MDIyMzAwNTExMjAzMjgwMDAwMDAwNS0yMDI0MDIyMzAwNTE0NjMyMDEwMDAwMDAxNV0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmV4dHJhW1wicmVxdWlyZWRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LVp2MDFFbGhhamJCNjIwMjQwMjIzMDA1MTEyMDMyODAwMDAwMDA1LTIwMjQwMjIzMDA1MTQ2MzI1MzAwMDAwMDE2XSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBhd3NfZGJfaW5zdGFuY2Uua2V5Y2xvYWNrIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19kYl9pbnN0YW5jZVwiIFwia2V5Y2xvYWNrXCIgeyUwQSAgICAgICsgYWRkcmVzcyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFsbG9jYXRlZF9zdG9yYWdlICAgICAgICAgICAgICAgICAgICAgPSAxMCUwQSAgICAgICsgYXBwbHlfaW1tZWRpYXRlbHkgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXV0b19taW5vcl92ZXJzaW9uX3VwZ3JhZGUgICAgICAgICAgICA9IHRydWUlMEEgICAgICArIGF2YWlsYWJpbGl0eV96b25lICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBiYWNrdXBfcmV0ZW50aW9uX3BlcmlvZCAgICAgICAgICAgICAgID0gNyUwQSAgICAgICsgYmFja3VwX3RhcmdldCAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJhY2t1cF93aW5kb3cgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjYV9jZXJ0X2lkZW50aWZpZXIgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2hhcmFjdGVyX3NldF9uYW1lICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNvcHlfdGFnc190b19zbmFwc2hvdCAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgZGJfbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrXCIlMEEgICAgICArIGRiX3N1Ym5ldF9ncm91cF9uYW1lICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZWxldGVfYXV0b21hdGVkX2JhY2t1cHMgICAgICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgZGVsZXRpb25fcHJvdGVjdGlvbiAgICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICArIGRvbWFpbl9mcWRuICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBlbmRwb2ludCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5naW5lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwibXlzcWxcIiUwQSAgICAgICsgZW5naW5lX3ZlcnNpb24gICAgICAgICAgICAgICAgICAgICAgICA9IFwiOC4wXCIlMEEgICAgICArIGVuZ2luZV92ZXJzaW9uX2FjdHVhbCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkZW50aWZpZXIgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZGVudGlmaWVyX3ByZWZpeCAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2stXCIlMEEgICAgICArIGluc3RhbmNlX2NsYXNzICAgICAgICAgICAgICAgICAgICAgICAgPSBcImRiLnQzLm1pY3JvXCIlMEEgICAgICArIGlvcHMgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBrbXNfa2V5X2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbGF0ZXN0X3Jlc3RvcmFibGVfdGltZSAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGxpY2Vuc2VfbW9kZWwgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsaXN0ZW5lcl9lbmRwb2ludCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFpbnRlbmFuY2Vfd2luZG93ICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1hbmFnZV9tYXN0ZXJfdXNlcl9wYXNzd29yZCAgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBtYXN0ZXJfdXNlcl9zZWNyZXQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFzdGVyX3VzZXJfc2VjcmV0X2ttc19rZXlfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1heF9hbGxvY2F0ZWRfc3RvcmFnZSAgICAgICAgICAgICAgICAgPSAxMDAlMEEgICAgICArIG1vbml0b3JpbmdfaW50ZXJ2YWwgICAgICAgICAgICAgICAgICAgPSAwJTBBICAgICAgKyBtb25pdG9yaW5nX3JvbGVfYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbXVsdGlfYXogICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICArIG5jaGFyX2NoYXJhY3Rlcl9zZXRfbmFtZSAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuZXR3b3JrX3R5cGUgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3B0aW9uX2dyb3VwX25hbWUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhcmFtZXRlcl9ncm91cF9uYW1lICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwZXJmb3JtYW5jZV9pbnNpZ2h0c19lbmFibGVkICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIHBlcmZvcm1hbmNlX2luc2lnaHRzX2ttc19rZXlfaWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwZXJmb3JtYW5jZV9pbnNpZ2h0c19yZXRlbnRpb25fcGVyaW9kID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9ydCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHB1YmxpY2x5X2FjY2Vzc2libGUgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgcmVwbGljYV9tb2RlICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlcGxpY2FzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXNvdXJjZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2tpcF9maW5hbF9zbmFwc2hvdCAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBzbmFwc2hvdF9pZGVudGlmaWVyICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RhdHVzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0b3JhZ2VfdGhyb3VnaHB1dCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdG9yYWdlX3R5cGUgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGltZXpvbmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHVzZXJuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2Fja19kYmFcIiUwQSAgICAgICsgdnBjX3NlY3VyaXR5X2dyb3VwX2lkcyAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBhd3NfZGJfc3VibmV0X2dyb3VwLmtleWNsb2FjayB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZGJfc3VibmV0X2dyb3VwXCIgXCJrZXljbG9hY2tcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgID0gXCJNYW5hZ2VkIGJ5IFRlcnJhZm9ybVwiJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgICAgPSBcImtleWNsb2Fja1wiJTBBICAgICAgKyBzdWJuZXRfaWRzICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgKyBcInN1Ym5ldC0wNmNhZjcxYzhiMGFmZDkwOVwiLCUwQSAgICAgICAgICArIFwic3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXCIsJTBBICAgICAgICBdJTBBICAgICAgKyBzdXBwb3J0ZWRfbmV0d29ya190eXBlcyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB2cGNfaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBhd3Nfc2VjdXJpdHlfZ3JvdXAua2V5Y2xvYWNrIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zZWN1cml0eV9ncm91cFwiIFwia2V5Y2xvYWNrXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcImtleWNsb2FjayBSRFMgaW5zdGFuY2VcIiUwQSAgICAgICsgZWdyZXNzICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbmdyZXNzICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSBcImtleWNsb2Fjay1kYi1cIiUwQSAgICAgICsgb3duZXJfaWQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJldm9rZV9ydWxlc19vbl9kZWxldGUgPSBmYWxzZSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiA9IFwia2V5Y2xvYWNrIFJEU1wiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwia2V5Y2xvYWNrIFJEU1wiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgPSBcInZwYy0wOGUxOWQ4NTljMjZkMThiMlwiJTBBICAgIH0lMEElMEEgICMgYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5rZXljbG9hY2tfb3V0Z29pbmcgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZVwiIFwia2V5Y2xvYWNrX291dGdvaW5nXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwiLTFcIiUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiID0gXCJvdXRnb2luZyB0cmFmZmljXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJvdXRnb2luZyB0cmFmZmljXCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2Fjay1pY21wIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJrZXljbG9hY2staWNtcFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIiUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgYWxsIElDTVAgdHJhZmZpY1wiJTBBICAgICAgKyBmcm9tX3BvcnQgICAgICAgICAgICAgID0gLTElMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJpY21wXCIlMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiA9IFwiSUNNUCB0cmFmZmljXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJJQ01QIHRyYWZmaWNcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gLTElMEEgICAgfSUwQSUwQSAgIyBhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5rZXljbG9hY2stbXlzcWwgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImtleWNsb2Fjay1teXNxbFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIxMC4wLjAuMC8yMlwiJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJBbGxvdyBteXNxbCB0cmFmZmljXCIlMEEgICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSAzMzA2JTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwidGNwXCIlMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiA9IFwibXlzcWwgYWNjZXNzXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJteXNxbCBhY2Nlc3NcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gMzMwNiUwQSAgICB9JTBBJTBBUGxhbjogNiB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDAiLCAic3RkZXJyIjogIiIsICJhZGQiOiA2LCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=```
</p></details>